tutorials/HorizontalFilm/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 0 0 1 0 0 0];

internalField   uniform 453.03;


boundaryField
{
    right
    {
        type            fixedValue;
        value           uniform 453.03;	
    }
    
    left
    {
        type            fixedValue;
        value           uniform 423.03;
    }
    
    frontAndBackAndUpAndDown
    {
        type            empty;
    }
}

// ************************************************************************* //
