tutorials/HorizontalFilm/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    right
    {
        type            zeroGradient;
        inletValue	    uniform (0 0 0);
        value           uniform (0 0 0);   
    }
    
    left
    {
        type            fixedValue;
        value           uniform (0 0 0);    
    }
    
    frontAndBackAndUpAndDown 
    {
        type	         empty; 
    }

}

// ************************************************************************* //
