tutorials/HorizontalFilm/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1000000;

boundaryField
{
    right
    {
        type            fixedValue;
        value           uniform 1000000;
    }
    
    left
    {
        type            zeroGradient;
    }
    
    frontAndBackAndUpAndDown 
    {
        type            empty; 
    }
}

// ************************************************************************* //
