tutorials/HorizontalFilm/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 0.00001;

D 50;


vertices        
(
    (0  0 0)
    (30 0 0)
    (30  2 0)
    (0   2 0)
    (0  0 0.2)
    (30 0 0.2)
    (30  2 0.2)
    (0   2 0.2)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) ($D 1 1) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
  

    patch left 
    (
        (0 4 7 3)
    )
    patch right 
    (
        (2 6 5 1)
    ) 

    empty frontAndBackAndUpAndDown 
    (
        (3 7 6 2)
        (1 5 4 0)
        (0 3 2 1)
        (4 5 6 7)
    )
);

mergePatchPairs 
(
);

// ************************************************************************* //
