tutorials/HorizontalFilm/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     LSThermalPhaseChangeFlow;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         4;

deltaT          1E-08;

writeControl    adjustableRunTime;

writeInterval   .25;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.01;
maxAlphaCo      0.01;
maxDeltaT       1E-05;


functions
{
    
    interfaceParameters
    {
        type interfaceParameters;
        libs ("libinterfaceParametersFunctionObject.so");
        phase alpha.water;
        writeControl    writeTime;
        writeToFile true;
        enabled true;
    }
    
    
    interfaceHeight1
    {
        // Mandatory entries
        type            interfaceHeight;
        libs            (fieldFunctionObjects);
        locations       ((0 0 0));
        

        // Optional entries
        alpha           alpha.water;
        direction       (1 0 0);
        interpolationScheme    cellPoint;

        // Optional (inherited) entries
        writePrecision   16;

        enabled         true;
        log             true;
        timeStart       0;
        timeEnd         5;
        writeControl    writeTime;

    }
    
}
